Strg-Alt-Entf-0x00/firered-vad-esp32-p4/examples/console_vad/sdkconfig.defaults
# ESP32-P4 Target
CONFIG_IDF_TARGET="esp32p4"
# ESP32-P4 Chip Revision Support
# This configuration supports ALL revisions: v1.0, v1.1, v1.3, and v3.x
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_0=y
CONFIG_ESP32P4_REV_MIN_FULL=0
# CPU Frequency (360 MHz for optimal DSP performance)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y
# Flash Configuration
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="32MB"
# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
# PSRAM (Required for FireVAD models)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
# Console
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
# SPIFFS (16MB partition requires larger page size)
CONFIG_SPIFFS_MAX_PARTITIONS=3
CONFIG_SPIFFS_PAGE_SIZE=512
CONFIG_SPIFFS_OBJ_NAME_LEN=64
CONFIG_SPIFFS_USE_MAGIC=y
CONFIG_SPIFFS_USE_MAGIC_LENGTH=y
# I2S
CONFIG_I2S_ENABLE_DEBUG_LOG=n
# Enable Microphone Audio
CONFIG_FIREVAD_ENABLE_AUDIO=y
CONFIG_DSP_ANSI=y
CONFIG_DSP_OPTIMIZED=n
